rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
/* ============================================================================
 *
 * STC-1200 Search/Timer/Comm Controller for Ampex MM-1200 Tape Machines
 *
 * Copyright (C) 2016-2018, RTZ Professional Audio, LLC
 * All Rights Reserved
 *
 * RTZ is registered trademark of RTZ Professional Audio, LLC
 *
 * ============================================================================
 *
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* XDCtools Header files */
#include <xdc/std.h>
#include <xdc/cfg/global.h>
#include <xdc/runtime/System.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Gate.h>

/* BIOS Header files */
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/knl/Event.h>
#include <ti/sysbios/knl/Mailbox.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

/* TI-RTOS Driver files */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/I2C.h>
#include <ti/drivers/UART.h>

/* NDK BSD support */
#include <sys/socket.h>

#include <file.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdbool.h>
#include <limits.h>

#include <stdint.h>
#include <stdbool.h>
#include <inc/hw_memmap.h>
#include <inc/hw_types.h>
#include <inc/hw_ints.h>
#include <inc/hw_gpio.h>

#include <driverlib/sysctl.h>
#include <driverlib/gpio.h>
#include <driverlib/sysctl.h>
#include <driverlib/qei.h>
#include <driverlib/pin_map.h>

/* PMX42 Board Header file */
#include "Board.h"
#include "STC1200.h"

/* External Data Items */

extern SYSDATA g_sysData;

extern Mailbox_Handle g_mailboxLocate;

/* Static Function Prototypes */

/*****************************************************************************
 * This functions stores the current tape position to a cue point in the
 * cue point locate table. The parameter index must be the range of
 * zero to MAX_CUE_POINTS-1.
 *****************************************************************************/

void CuePointStore(size_t index)
{
    Semaphore_pend(g_semaCue, BIOS_WAIT_FOREVER);

	if (index < MAX_CUE_POINTS)
	{
		g_sysData.cuePoint[index].ipos  = g_sysData.tapePosition;
		g_sysData.cuePoint[index].flags = 0x01;
	}

	Semaphore_post(g_semaCue);
}

/*****************************************************************************
 * This functions stores the current tape position to a cue point in the
 *****************************************************************************/

void CuePointClear(size_t index)
{
	Semaphore_pend(g_semaCue, BIOS_WAIT_FOREVER);

	if (index < MAX_CUE_POINTS)
	{
		g_sysData.cuePoint[index].ipos  = 0;
		g_sysData.cuePoint[index].flags = 0x00;
	}

	Semaphore_post(g_semaCue);
}

/*****************************************************************************
 * Queues up a command to the locator task.
 *****************************************************************************/

void QueueLocateCommand(LocateType command, uint32_t param1, uint32_t param2)
{
    LocateMessage msg;

    msg.command = command;      /* Set the command message type */
    msg.param1  = param1;
    msg.param2  = param2;

    Mailbox_post(g_mailboxLocate, &msg, 10);
}

//*****************************************************************************
// Position reader/display task. This function reads the tape roller
// quadrature encoder and stores the current position data. The 7-segement
// tape position display is also updated via the task so the current tape
// position is always being shown on the machine's display on the transport.
//*****************************************************************************

Void LocateTaskFxn(UArg arg0, UArg arg1)
{
	uint32_t key;
	size_t index;
    LocateMessage msg;

    while (true)
    {
    	/* Clear SEARCHING_OUT status i/o pin */
    	GPIO_write(Board_SEARCHING, PIN_HIGH);

    	/* Wait for a message up to 1 second */
        if (!Mailbox_pend(g_mailboxLocate, &msg, 500))
        	continue;

        if (msg.command != LOCATE_SEARCH)
        	continue;

        if ((index = msg.param1) >= MAX_CUE_POINTS)
        	continue;

        if (g_sysData.cuePoint[index].flags == 0)
        	continue;

        System_printf("LOCATE[%d] %d\n", index, g_sysData.cuePoint[index].ipos);
		System_flush();

		/* Set SEARCHING_OUT status i/o pin */
		GPIO_write(Board_SEARCHING, PIN_LOW);

		/*
		 * BEGIN AUTO-LOCATE SEARCH FUNCTION
		 */

	    key = Hwi_disable();
	    g_sysData.searchActive = true;
	    Hwi_restore(key);

		while (g_sysData.searchActive)
		{
			/* Get distance in inches from zero reset point */
			float distance = POSITION_TO_INCHES((float)g_sysData.tapePosition);

			/* Calculate the current position delta from cue point */
			int delta = g_sysData.cuePoint[index].ipos - g_sysData.tapePosition;

			float tach = TapeTach_read();

			System_printf("%d : %d : %f\n", g_sysData.tapePosition, delta, tach);
			System_flush();

			Task_sleep(500);
		}

		System_printf("SEARCH CANCELED\n");
		System_flush();
    }
}

/* End-Of-File */
